mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    tifs = g_ble_phy_data.tifs_usecs;

    if (txrx == BLE_PHY_WFR_ENABLE_TXRX) {
        /* RX shall start exactly T_IFS after TX end captured in CC[2] */
        end_time = NRF_TIMER0->CC[2] + tifs;
        /* Adjust for delay between EVENT_END and actual TX end time */
        end_time += g_ble_phy_t_txenddelay[tx_phy_mode];
        /* Wait a bit longer due to allowed active clock accuracy */
        end_time += 2;
        /*
         * It's possible that we'll capture PDU start time at the end of timer
         * cycle and since wfr expires at the beginning of calculated timer
         * cycle it can be almost 1 usec too early. Let's compensate for this
         * by waiting 1 usec more.
         */
        end_time += 1;

        end_time += MYNEWT_VAL(BLE_PHY_EXTENDED_TIFS);
    } else {
        /*
         * RX shall start no later than wfr_usecs after RX enabled.
         * CC[0] is the time of RXEN so adjust for radio ram-up.
         * Do not add jitter since this is already covered by LL.
         */
        end_time = NRF_TIMER0->CC[0] + BLE_PHY_T_RXENFAST + wfr_usecs;
    }

    /*
     * Note: on LE Coded EVENT_ADDRESS is fired after TERM1 is received, so
     *       we are actually calculating relative to start of packet payload
     *       which is fine.
     */

    /* Adjust for receiving access address since this triggers EVENT_ADDRESS */
    end_time += ble_phy_mode_pdu_start_off(phy);
    /* Adjust for delay between actual access address RX and EVENT_ADDRESS */
    end_time += g_ble_phy_t_rxaddrdelay[phy];

    ble_phy_wfr_enable_at(end_time);
}

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
static uint32_t
ble_phy_get_ccm_datarate(void)
{
#if MYNEWT_VAL(BLE_LL_PHY)
    switch (g_ble_phy_data.phy_cur_phy_mode) {
    case BLE_PHY_MODE_1M:
        return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
    case BLE_PHY_MODE_2M:
        return CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    case BLE_PHY_MODE_CODED_125KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_125Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_125Kbps << CCM_MODE_DATARATE_Pos;
#endif
    case BLE_PHY_MODE_CODED_500KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_500Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_500Kbps << CCM_MODE_DATARATE_Pos;
#endif
#endif
    }

    assert(0);
    return 0;
#else
    return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
#endif
}
#endif

/**
 * Setup transceiver for receive.
 */
static void
ble_phy_rx_xcvr_setup(uint16_t tifs_usecs)
{
    uint8_t *dptr;
    uint32_t interrupt_mask;

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_enc_buf[0];
#ifdef NRF54L_SERIES
        NRF_CCM->IN.PTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUT.PTR = (uint32_t)dptr;
        /* TODO: Find replacement for removed registers like this one
         * NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
         */
        NRF_CCM->MODE = CCM_MODE_MACLEN_Pos | CCM_MODE_MODE_Decryption |
                        ble_phy_get_ccm_datarate();
        memcpy((uint8_t *)NRF_CCM->KEY.VALUE, &g_nrf_ccm_data.key, sizeof(g_nrf_ccm_data.key));
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_END = 0;
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_START);
#else
        NRF_CCM->INPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUTPTR = (uint32_t)dptr;
        NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
        NRF_CCM->MODE = CCM_MODE_LENGTH_Msk | CCM_MODE_MODE_Decryption |
                                                    ble_phy_get_ccm_datarate();
        NRF_CCM->CNFPTR = (uint32_t)&g_nrf_ccm_data;
        NRF_CCM->SHORTS = 0;
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_ENDCRYPT = 0;
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_KSGEN);
#endif
        phy_ppi_radio_address_to_ccm_crypt_enable();
    } else {
        NRF_RADIO->PACKETPTR = (uint32_t)dptr;
    }
#else
    NRF_RADIO->PACKETPTR = (uint32_t)dptr;
#endif

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    if (g_ble_phy_data.phy_privacy) {
        NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Enabled;
#ifdef NRF54L_SERIES
        NRF_AAR->IN.PTR = (uint32_t)&g_nrf_irk_list[0];
        /* TODO: Find replacement for NRF_AAR->SCRATCHPTR */
#else
        NRF_AAR->IRKPTR = (uint32_t)&g_nrf_irk_list[0];
        NRF_AAR->SCRATCHPTR = (uint32_t)&g_ble_phy_data.phy_aar_scratch;
#endif
        NRF_AAR->EVENTS_END = 0;
        NRF_AAR->EVENTS_RESOLVED = 0;
        NRF_AAR->EVENTS_NOTRESOLVED = 0;
    } else {
        if (g_ble_phy_data.phy_encrypted == 0) {
            NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Disabled;
        }
    }
#endif

    /* Turn off trigger TXEN on output compare match and AAR on bcmatch */
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_timer0_compare0_to_radio_start_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();

    /* Reset the rx started flag. Used for the wait for response */
    g_ble_phy_data.phy_rx_started = 0;
    g_ble_phy_data.phy_state = BLE_PHY_STATE_RX;

#if MYNEWT_VAL(BLE_LL_PHY)
    /*
     * On Coded PHY there are CI and TERM1 fields before PDU starts so we need
     * to take this into account when setting up BCC.
     */
    if (g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_125KBPS ||
            g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_500KBPS) {
        g_ble_phy_data.phy_bcc_offset = 5;
    } else {
        g_ble_phy_data.phy_bcc_offset = 0;
    }
#else
    g_ble_phy_data.phy_bcc_offset = 0;
#endif

    /* I want to know when 1st byte received (after address) */
    nrf_radio_bcc_set(NRF_RADIO, g_ble_phy_data.phy_bcc + g_ble_phy_data.phy_bcc_offset); /* in bits */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_DEVMATCH = 0;
    NRF_RADIO->EVENTS_BCMATCH = 0;
    NRF_RADIO->EVENTS_CRCOK = 0;
#ifdef NRF54L_SERIES
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk;

    if (tifs_usecs < BLE_LL_IFS) {
        interrupt_mask = RADIO_INTENSET00_ADDRESS_Msk |
                         RADIO_INTENSET00_PHYEND_Msk;
    } else {
        NRF_RADIO->SHORTS |= RADIO_SHORTS_PHYEND_DISABLE_Msk;
        interrupt_mask = RADIO_INTENSET00_ADDRESS_Msk |
                         RADIO_INTENSET00_DISABLED_Msk;
    }
#else
    NRF_RADIO->EVENTS_RSSIEND = 0;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk |
                        RADIO_SHORTS_DISABLED_RSSISTOP_Msk;

    if (tifs_usecs < BLE_LL_IFS) {
        interrupt_mask = RADIO_INTENSET_ADDRESS_Msk |
                         RADIO_INTENSET_END_Msk;
    } else {
        NRF_RADIO->SHORTS |= RADIO_SHORTS_END_DISABLE_Msk;
        interrupt_mask = RADIO_INTENSET_ADDRESS_Msk |
                         RADIO_INTENSET_DISABLED_Msk;
    }
#endif
    nrf_radio_int_enable(NRF_RADIO, interrupt_mask);
}

static void
ble_phy_feat_mode_set(uint8_t phy_feature_mode)
{
    g_ble_phy_data.phy_feature_mode = phy_feature_mode;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    NRF_RADIO->CSTONES.MODE = 0;
    NRF_RADIO->RTT.CONFIG = 0;
#endif
    if (phy_feature_mode == PHY_FEAT_MODE_BLE_LL) {
        phy_ppi_debug_disable();
        /* Configure back the registers */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos) | RADIO_CRCCNF_LEN_Three;
        NRF_RADIO->PCNF0 = NRF_PCNF0;
        NRF_RADIO->PCNF1 = NRF_MAXLEN |
                           (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                           (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                           RADIO_PCNF1_WHITEEN_Msk;

        g_ble_phy_data.phy_bcc = 8;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
        } else if (phy_feature_mode == PHY_FEAT_MODE_BLE_CS_SYNC) {
        phy_ppi_debug_enable();
        /* CS SYNC packet has no PDU or CRC */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos);
        /* CS_SYNC needs only PAYLOAD field, so do not transmit S0, LENGTH and S1 fields. */
        NRF_RADIO->PCNF0 = RADIO_PCNF0_S1INCL_Include << RADIO_PCNF0_S1INCL_Pos;
        /* Disable whitening */
        NRF_RADIO->PCNF1 = (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                           (NRF_BALEN << RADIO_PCNF1_BALEN_Pos);

        g_ble_phy_data.phy_bcc = 0;
//        NRF_RADIO->RTT.CONFIG = RADIO_RTT_CONFIG_EN_Enabled << RADIO_RTT_CONFIG_EN_Pos |
//                                RADIO_RTT_CONFIG_ENFULLAA_Enabled << RADIO_RTT_CONFIG_ENFULLAA_Pos |
//                                RADIO_RTT_CONFIG_ROLE_Reflector << RADIO_RTT_CONFIG_ROLE_Pos |
//                                (256UL) << RADIO_RTT_CONFIG_EFSDELAY_Pos;
    } else if (phy_feature_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
#if !BABBLESIM
        phy_ppi_debug_enable();
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk | RADIO_CSTONES_MODE_TFM_Msk;
        NRF_RADIO->CSTONES.NUMSAMPLES = RADIO_CSTONES_NUMSAMPLES_ResetValue;
        NRF_RADIO->CSTONES.NEXTFREQUENCY = 0;
//        NRF_RADIO->CSTONES.PHASESHIFT = 0;
//        NRF_RADIO->CSTONES.NUMSAMPLESCOEFF = 0;
#endif
#endif
    }
}

static uint32_t
ble_phy_transition_anchor_get(uint8_t tifs_anchor, uint8_t phy_state,
                              uint8_t phy_mode, uint8_t feat_mode)
{
    uint32_t time;

