mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    if (feat_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
        return NRF_TIMER0->CC[2];
    }
#endif

    if (tifs_anchor == PHY_TRANS_ANCHOR_END) {
        /* END timestamp is captured in CC[2] */
        time = NRF_TIMER0->CC[2];

        /* Adjust for delay between EVENT_END and actual TX/RX end time */
        time += (phy_state == BLE_PHY_STATE_TX)
                ? g_ble_phy_t_txenddelay[phy_mode]
                : -g_ble_phy_t_rxenddelay[phy_mode];

    } else {
        /* ADDRESS timestamp is captured in CC[1] */
        time = NRF_TIMER0->CC[1];

        /* Adjust for delay between EVENT_ADDRESS and actual AA time ota */
        time += (phy_state == BLE_PHY_STATE_TX)
                ? g_ble_phy_t_txaddrdelay[phy_mode]
                : -g_ble_phy_t_rxaddrdelay[phy_mode];

        /* Adjust by sync word length to get TX/RX start time */
        time -= ble_ll_pdu_syncword_us(phy_mode);
    }

    return time;
}

static int
ble_transition_to_tx(uint8_t tifs_anchor, uint16_t tifs_usecs, uint16_t wfr_usecs,
                     uint8_t phy_state, uint8_t next_feat_mode)
{
    uint32_t anchor_time;
    uint32_t radio_time;
    uint32_t start_time;
    bool is_late;
    uint8_t next_phy_mode;
    uint8_t prev_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle) {
        nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
        nrf_wait_disabled();
    }

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_tx_phy_mode);
#endif
    next_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    anchor_time = ble_phy_transition_anchor_get(tifs_anchor, phy_state, prev_phy_mode,
                                                g_ble_phy_data.phy_feature_mode);
    start_time = anchor_time + tifs_usecs;
    radio_time = start_time;

#if PHY_USE_FEM_PA
    fem_time = anchor_time - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
    nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
    NRF_TIMER0->EVENTS_COMPARE[2] = 0;
    phy_fem_enable_pa();
#endif

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        /* Adjust for TX rump-up */
        radio_time -= BLE_PHY_T_TXENFAST;
        /* Adjust for delay between EVENT_READY and actual TX start time */
        radio_time -= g_ble_phy_t_txdelay[next_phy_mode];
        phy_ppi_timer0_compare0_to_radio_txen_enable();
    } else {
        /* Fast TX_TX transition */
        BLE_LL_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_TxIdle);
        /* TODO: Adjust for delay between TASK_START and actual TX start time */
        radio_time -= g_ble_phy_t_txdelay[next_phy_mode];
        phy_ppi_timer0_compare0_to_radio_start_enable();
    }

    /* Need to check if TIMER0 did not already count past CC[0] and/or CC[2], so
     * we're not stuck waiting for events in case radio and/or PA was not
     * started. If event was triggered we're fine regardless of timer value.
     *
     * Note: CC[3] is used only for wfr which we do not need here.
     */
    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE4);
    is_late = (NRF_TIMER0->CC[4] > radio_time) && !NRF_TIMER0->EVENTS_COMPARE[0];
#if PHY_USE_FEM_PA
    is_late = is_late || ((NRF_TIMER0->CC[4] > NRF_TIMER0->CC[2]) &&
                              !NRF_TIMER0->EVENTS_COMPARE[2]);
#endif
    if (is_late) {
        g_ble_phy_data.phy_transition_late = 1;

        return 1;
    }

    if (next_feat_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
        ble_phy_set_stop_time(wfr_usecs);
    }

    nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;
    ble_phy_feat_mode_set(next_feat_mode);

    return 0;
}

static int
ble_transition_to_rx(uint8_t tifs_anchor, uint16_t tifs_usecs, uint16_t wfr_usecs,
                     uint8_t phy_state, uint8_t next_feat_mode)
{
    uint32_t anchor_time;
    uint32_t radio_time;
    uint32_t start_time;
    uint32_t wfr_time;
    uint8_t next_phy_mode;
    uint8_t prev_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_TxIdle) {
        nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
        nrf_wait_disabled();
    }

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_rx_phy_mode);
#endif
    /* Packet pointer needs to be reset. */
    ble_phy_rx_xcvr_setup(tifs_usecs);
    next_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    anchor_time = ble_phy_transition_anchor_get(tifs_anchor, phy_state, prev_phy_mode,
                                                g_ble_phy_data.phy_feature_mode);
    start_time = anchor_time + tifs_usecs;
    radio_time = start_time;

#if PHY_USE_FEM_LNA
    fem_time = anchor_time - MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
    nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
    NRF_TIMER0->EVENTS_COMPARE[2] = 0;
    phy_fem_enable_lna();
#endif

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        /* Adjust for RX rump-up */
        radio_time -= BLE_PHY_T_RXENFAST;
        /* Start listening a bit earlier due to allowed active clock accuracy */
        radio_time -= 2;
        phy_ppi_timer0_compare0_to_radio_rxen_enable();
    } else {
        /* Fast RX_RX transition */
        BLE_LL_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle);
        /* Start listening a bit earlier due to allowed active clock accuracy */
        radio_time -= 2;
        phy_ppi_timer0_compare0_to_radio_start_enable();
    }

    if (next_feat_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
        ble_phy_set_stop_time(wfr_usecs);
    } else {
        /* Setup wfr relative to expected radio/PDU start */
        wfr_time = start_time;
        /* Add amount of usecs to wait */
        wfr_time += wfr_usecs;
        /* Adjust for receiving access address since this triggers EVENT_ADDRESS */
        wfr_time += ble_phy_mode_pdu_start_off(next_phy_mode);
        /* Adjust for delay between actual access address RX and EVENT_ADDRESS */
        wfr_time += g_ble_phy_t_rxaddrdelay[next_phy_mode];
        /* Wait a bit longer due to allowed active clock accuracy */
        wfr_time += 2;
        /*
         * It's possible that we'll capture PDU start time at the end of timer
         * cycle and since wfr expires at the beginning of calculated timer
         * cycle it can be almost 1 usec too early. Let's compensate for this
         * by waiting 1 usec more.
         */
        wfr_time += 1;
        wfr_time += MYNEWT_VAL(BLE_PHY_EXTENDED_TIFS);
        ble_phy_wfr_enable_at(wfr_time);
    }

    /* In case TIMER0 did already count past CC[0] and/or CC[2], radio
     * and/or LNA may not be enabled. In any case we won't be stuck since
     * wfr will cancel rx if needed.
     *
     * FIXME failing to enable LNA may result in unexpected RSSI drop in
     *       case we still rxd something, so perhaps we could check it here
     */

    nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;
    ble_phy_feat_mode_set(next_feat_mode);

