mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    return 0;
}

/**
 * ble phy txpwr get
 *
 * Get the transmit power.
 *
 * @return int  The current PHY transmit power, in dBm
 */
int
ble_phy_tx_power_get(void)
{
    return g_ble_phy_data.phy_txpwr_dbm;
}

/**
 * ble phy setchan
 *
 * Sets the logical frequency of the transceiver. The input parameter is the
 * BLE channel index (0 to 39, inclusive). The NRF frequency register works like
 * this: logical frequency = 2400 + FREQ (MHz).
 *
 * Thus, to get a logical frequency of 2402 MHz, you would program the
 * FREQUENCY register to 2.
 *
 * @param chan This is the Data Channel Index or Advertising Channel index
 *
 * @return int 0: success; PHY error code otherwise
 */
int
ble_phy_setchan(uint8_t chan, uint32_t access_addr, uint32_t crcinit)
{
    assert(chan < BLE_PHY_NUM_CHANS);

    /* Check for valid channel range */
    if (chan >= BLE_PHY_NUM_CHANS) {
        return BLE_PHY_ERR_INV_PARAM;
    }

    /* Set current access address */
    ble_phy_set_access_addr(access_addr);

    /* Configure crcinit */
    NRF_RADIO->CRCINIT = crcinit;

    /* Set the frequency and the data whitening initial value */
    g_ble_phy_data.phy_chan = chan;
    NRF_RADIO->FREQUENCY = g_ble_phy_chan_freq[chan];

#ifdef NRF54L_SERIES
    NRF_RADIO->DATAWHITE = RADIO_DATAWHITE_ResetValue | chan;
#else
    NRF_RADIO->DATAWHITEIV = chan;
#endif

    return 0;
}

uint8_t
ble_phy_chan_get(void)
{
    return g_ble_phy_data.phy_chan;
}

/**
 * Stop the timer used to count microseconds when using RTC for cputime
 */
static void
ble_phy_stop_usec_timer(void)
{
    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_STOP);
#ifdef NRF54L_SERIES
    nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_STOP);
#endif
#ifndef NRF54L_SERIES
    NRF_TIMER0->TASKS_SHUTDOWN = 1;
#endif
    nrf_rtc_event_disable(NRF_RTC0, RTC_EVTENSET_COMPARE0_Msk);
}

/**
 * ble phy disable irq and ppi
 *
 * This routine is to be called when reception was stopped due to either a
 * wait for response timeout or a packet being received and the phy is to be
 * restarted in receive mode. Generally, the disable routine is called to stop
 * the phy.
 */
static void
ble_phy_disable_irq_and_ppi(void)
{
    nrf_radio_int_disable(NRF_RADIO, NRF_RADIO_IRQ_MASK_ALL);
    NRF_RADIO->SHORTS = 0;
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
    phy_ppi_disable();
    NVIC_ClearPendingIRQ(RADIO_IRQn);
    g_ble_phy_data.phy_state = BLE_PHY_STATE_IDLE;
}

void
ble_phy_restart_rx(void)
{
    ble_phy_stop_usec_timer();
    ble_phy_disable_irq_and_ppi();

    ble_phy_set_start_now();
    /* Enable PPI to automatically start RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_enable();

    ble_phy_rx();
}

/**
 * ble phy disable
 *
 * Disables the PHY. This should be called when an event is over. It stops
 * the usec timer (if used), disables interrupts, disables the RADIO, disables
 * PPI and sets state to idle.
 */
void
ble_phy_disable(void)
{
    ble_phy_trace_void(BLE_PHY_TRACE_ID_DISABLE);

#if PHY_USE_HEADERMASK_WORKAROUND
    NRF_CCM->INTENCLR = CCM_INTENCLR_ENDKSGEN_Msk;
#endif

    ble_phy_stop_usec_timer();
    ble_phy_disable_irq_and_ppi();

    g_ble_phy_data.phy_transition_late = 0;
    ble_phy_transition_set(BLE_PHY_TRANSITION_NONE, 0);
    ble_phy_feat_mode_set(PHY_FEAT_MODE_BLE_LL);

#if PHY_USE_FEM
    phy_fem_disable();
#endif
}

/* Gets the current access address */
uint32_t ble_phy_access_addr_get(void)
{
    return g_ble_phy_data.phy_access_address;
}

/**
 * Return the phy state
 *
 * @return int The current PHY state.
 */
int
ble_phy_state_get(void)
{
    return g_ble_phy_data.phy_state;
}

/**
 * Called to see if a reception has started
 *
 * @return int
 */
int
ble_phy_rx_started(void)
{
    return g_ble_phy_data.phy_rx_started;
}

/**
 * Return the transceiver state
 *
 * @return int transceiver state.
 */
uint8_t
ble_phy_xcvr_state_get(void)
{
    uint32_t state;
    state = NRF_RADIO->STATE;
    return (uint8_t)state;
}

/**
 * Called to return the maximum data pdu payload length supported by the
 * phy. For this chip, if encryption is enabled, the maximum payload is 27
 * bytes.
 *
 * @return uint8_t Maximum data channel PDU payload size supported
 */
uint8_t
ble_phy_max_data_pdu_pyld(void)
{
    return BLE_LL_DATA_PDU_MAX_PYLD;
}

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
void
ble_phy_resolv_list_enable(void)
{
#ifdef NRF54L_SERIES
    /* TODO: Is this the right replacement? */
    NRF_AAR->MAXRESOLVED = (uint32_t)g_nrf_num_irks;
#else
    NRF_AAR->NIRK = (uint32_t)g_nrf_num_irks;
#endif
    g_ble_phy_data.phy_privacy = 1;
}

void
ble_phy_resolv_list_disable(void)
{
    g_ble_phy_data.phy_privacy = 0;
}
#endif

#if MYNEWT_VAL(BLE_LL_DTM)
void ble_phy_enable_dtm(void)
{
    /* When DTM is enabled we need to disable whitening as per
     * Bluetooth v5.0 Vol 6. Part F. 4.1.1
     */
    NRF_RADIO->PCNF1 &= ~RADIO_PCNF1_WHITEEN_Msk;
}

void ble_phy_disable_dtm(void)
{
    /* Enable whitening */
    NRF_RADIO->PCNF1 |= RADIO_PCNF1_WHITEEN_Msk;
}

#if MYNEWT_VAL(BLE_LL_DTM_EXTENSIONS)
int
ble_phy_dtm_carrier(uint8_t rf_channel)
{
    /* based on Nordic DTM sample */
    ble_phy_disable();
    ble_phy_enable_dtm();
    ble_phy_mode_apply(BLE_PHY_MODE_1M);
    nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
    NRF_RADIO->FREQUENCY = g_ble_phy_chan_freq[rf_channel];
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);

    return 0;
}
#endif
#endif

void
ble_phy_rfclk_enable(void)
{
#if MYNEWT || defined(RIOT_VERSION)
#ifdef NRF52_SERIES
    nrf52_clock_hfxo_request();
#endif
#ifdef NRF53_SERIES
    nrf5340_net_clock_hfxo_request();
#endif
#else
    nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_HFCLKSTART);
#endif
}

void
ble_phy_rfclk_disable(void)
{
#if MYNEWT || defined(RIOT_VERSION)
#ifdef NRF52_SERIES
    nrf52_clock_hfxo_release();
#endif
#ifdef NRF53_SERIES
    nrf5340_net_clock_hfxo_release();
#endif
#else
    nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_HFCLKSTOP);
#endif
}

void
ble_phy_transition_set(uint8_t trans, uint16_t usecs)
{
    uint8_t transition;
    uint8_t anchor;
    uint8_t feat_mode;

    if (trans == BLE_PHY_TRANSITION_TO_TX_ISO_SUBEVENT ||
        trans == BLE_PHY_TRANSITION_TO_RX_ISO_SUBEVENT) {
        anchor = PHY_TRANS_ANCHOR_START;
    } else {
        anchor = PHY_TRANS_ANCHOR_END;
    }

    if (trans == BLE_PHY_TRANSITION_TO_RX ||
        trans == BLE_PHY_TRANSITION_TO_RX_ISO_SUBEVENT) {
        transition = PHY_TRANS_TO_RX;
        feat_mode = PHY_FEAT_MODE_BLE_LL;
    } else if (trans == BLE_PHY_TRANSITION_TO_TX ||
               trans == BLE_PHY_TRANSITION_TO_TX_ISO_SUBEVENT) {
        transition = PHY_TRANS_TO_TX;
        feat_mode = PHY_FEAT_MODE_BLE_LL;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    } else if (trans == BLE_PHY_TRANSITION_TO_TX_CS_SYNC) {
        transition = PHY_TRANS_TO_TX;
        feat_mode = PHY_FEAT_MODE_BLE_CS_SYNC;
    } else if (trans == BLE_PHY_TRANSITION_TO_RX_CS_SYNC) {
        transition = PHY_TRANS_TO_RX;
        feat_mode = PHY_FEAT_MODE_BLE_CS_SYNC;
    } else if (trans == BLE_PHY_TRANSITION_TO_TX_CS_TONE) {
        transition = PHY_TRANS_TO_TX;
        feat_mode = PHY_FEAT_MODE_BLE_CS_TONE;
    } else if (trans == BLE_PHY_TRANSITION_TO_RX_CS_TONE) {
        transition = PHY_TRANS_TO_RX;
        feat_mode = PHY_FEAT_MODE_BLE_CS_TONE;
#endif
    } else {
        transition = PHY_TRANS_NONE;
        feat_mode = PHY_FEAT_MODE_BLE_LL;
    }

    g_ble_phy_data.phy_transition = transition;
    g_ble_phy_data.tifs_anchor = anchor;
    g_ble_phy_data.tifs_usecs = usecs ? usecs : BLE_LL_IFS;
    g_ble_phy_data.next_phy_feature_mode = feat_mode;
}

void
ble_phy_wfr_set(uint16_t usecs)
{
    g_ble_phy_data.wfr_usecs = usecs;
}

