mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
void
ble_phy_get_txend_time(uint32_t *cputime, uint32_t *rem_us, uint32_t *rem_ns)
{
    *cputime = g_ble_phy_data.phy_start_cputime;
    *rem_us = g_ble_phy_data.txend_time_ticks;
    *rem_ns = 0;
}

void
ble_phy_get_rxend_time(uint32_t *cputime, uint32_t *rem_us, uint32_t *rem_ns)
{
    *cputime = g_ble_phy_data.phy_start_cputime;
    *rem_us = g_ble_phy_data.rxend_time_ticks;
    *rem_ns = 0;
}

int
ble_phy_cs_sync_configure(uint8_t chan, uint32_t access_addr)
{
    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        ble_phy_feat_mode_set(PHY_FEAT_MODE_BLE_CS_SYNC);
    }

#if BABBLESIM
    ble_phy_setchan(chan % 40, access_addr, 0);
#else
    assert(!(chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan));

    /* Check for valid channel range */
    if (chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan) {
        return BLE_PHY_ERR_INV_PARAM;
    }

    /* Set current access address */
    ble_phy_set_access_addr(access_addr);

    /* Set the frequency and the data whitening initial value */
    g_ble_phy_data.phy_chan = chan;
    NRF_RADIO->FREQUENCY = 2 + chan;
#endif

    return 0;
}

int
ble_phy_cs_tone_configure(uint8_t chan, uint8_t tone_mode)
{
    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        ble_phy_feat_mode_set(PHY_FEAT_MODE_BLE_CS_TONE);
    }

#if BABBLESIM
#else
    assert(!(chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan));

    /* Check for valid channel range */
    if (chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan) {
        return BLE_PHY_ERR_INV_PARAM;
    }

    /* Set the frequency and the data whitening initial value */
    g_ble_phy_data.phy_chan = chan;
    NRF_RADIO->FREQUENCY = 2 + chan;
    NRF_RADIO->CSTONES.NEXTFREQUENCY = 2 + chan;

    if (tone_mode == BLE_PHY_CS_TONE_MODE_PM) {
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk;
    } else if (tone_mode == BLE_PHY_CS_TONE_MODE_FM) {
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TFM_Msk;
    } else {
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk | RADIO_CSTONES_MODE_TFM_Msk;
    }
#endif

    return 0;
}
#endif
